//     Copyright (c) Microsoft Corporation.  All rights reserved.
using FastSerialization;
using Microsoft.Diagnostics.Tracing.Utilities;
using System;
using System.Diagnostics;
using System.Runtime.InteropServices;
using System.Text;
using Address = System.UInt64;

// This file was generated with the following command:
//    traceParserGen CLREtwAll.man CLRTraceEventParser.cs
// And then modified by hand to add functionality (handle to name lookup, fixup of evenMethodLoadUnloadTraceDMOatats ...)
// Note: /merge option is no more available (does not even compile)
namespace Microsoft.Diagnostics.Tracing.Parsers
{
    using Microsoft.Diagnostics.Tracing.Parsers.Clr;
    using System.Collections.Generic;

    /* Parsers defined in this file */
    // ClrTraceEventParser, ClrRundownTraceEventParser, ClrStressTraceEventParser 
    /* ClrPrivateTraceEventParser  #ClrPrivateProvider */
    // [SecuritySafeCritical]
    [System.CodeDom.Compiler.GeneratedCode("traceparsergen", "1.0")]
    public sealed class ClrTraceEventParser : TraceEventParser
    {
        public static readonly string ProviderName = "Microsoft-Windows-DotNETRuntime";
        public static readonly Guid ProviderGuid = new Guid(unchecked((int)0xe13c0d23), unchecked((short)0xccbc), unchecked((short)0x4e12), 0x93, 0x1b, 0xd9, 0xcc, 0x2e, 0xee, 0x27, 0xe4);

        // Project N and the Desktop have separate guids.  

            Debug.Assert(!(Version == 0 && EventDataLength != 18));
            Debug.Assert(!(Version > 0 && EventDataLength < 18));
        }
        public override StringBuilder ToXml(StringBuilder sb)
        {
            Prefix(sb);
            XmlAttrib(sb, "HeapNum", HeapNum);
            XmlAttrib(sb, "ClrInstanceID", ClrInstanceID);
            XmlAttrib(sb, "Type", Type);
            XmlAttrib(sb, "Promoted", Promoted);
            sb.Append("/>");
            return sb;
        }

        public override string[] PayloadNames
        {
            get
            {
                if (payloadNames == null)
                {
                    payloadNames = new string[] { "HeapNum", "ClrInstanceID", "Type", "Promoted" };
                }

                return payloadNames;
            }
        }

        public override object PayloadValue(int index)
        {
            switch (index)
            {
                case 0:
                    return HeapNum;
                case 1:
                    return ClrInstanceID;
                case 2:
                    return Type;
                case 3:
                    return Promoted;
                default:
                    Debug.Assert(false, "Bad field index");
                    return null;
            }
        }

        private event Action<GCMarkWithTypeTraceData> Action;
        #endregion
    }
    /// <summary>
    /// We keep Heap history for every Generation in 'Gens' 
    /// </summary>
    public enum Gens
    {
        Gen0,
        Gen1,
        Gen2,
        GenLargeObj,
        Gen0After,
    }

    /// <summary>
    /// Taken from gcrecords.h, used to differentiate heap expansion and compaction reasons
    /// </summary>
    public enum gc_heap_expand_mechanism : int
    {
        expand_reuse_normal = 0,
        expand_reuse_bestfit = 1,
        expand_new_seg_ep = 2, // new seg with ephemeral promotion
        expand_new_seg = 3,
        expand_no_memory = 4, // we can't get a new seg.
        expand_next_full_gc = 5,
        max_expand_mechanisms_count = 6,
        not_specified = 1024
    }
    public enum gc_heap_compact_reason : int
    {
        compact_low_ephemeral = 0,
        compact_high_frag = 1,
        compact_no_gaps = 2,
        compact_loh_forced = 3,
        compact_last_gc = 4,
        compact_induced_compacting = 5,
        compact_fragmented_gen0 = 6,
        compact_high_mem_load = 7,
        compact_high_mem_frag = 8,
        compact_vhigh_mem_frag = 9,
        compact_no_gc_mode = 10,
        max_compact_reasons_count = 11,
        not_specified = 1024
    }
    public enum gc_concurrent_compact_reason : int
    {
        concurrent_compact_high_frag = 0,
        concurrent_compact_c_mark = 1,
        max_concurrent_compat_reason = 2,
        not_specified = 1024
    }

    /// <summary>
    /// Version 0, PreciseVersion 0.1: Silverlight (x86)
    /// 0:041> dt -r2 coreclr!WKS::gc_history_per_heap
    ///    +0x000 gen_data         : [5] WKS::gc_generation_data
    ///       +0x000 size_before      : Uint4B/8B       : [0 - 40), [40 - 80), [80 - 120), [120 - 160), [160 - 200)
    ///       +0x004 size_after       : Uint4B/8B
    ///       +0x008 current_size     : Uint4B/8B
    ///       +0x00c previous_size    : Uint4B/8B
    ///       +0x010 fragmentation    : Uint4B/8B
    ///       +0x014 in               : Uint4B/8B
    ///       +0x018 out              : Uint4B/8B
    ///       +0x01c new_allocation   : Uint4B/8B
    ///       +0x020 surv             : Uint4B/8B
    ///       +0x024 growth           : Uint4B/8B
    ///    +0x0c8 mem_pressure        : Uint4B      : 200
    ///    +0x0cc mechanisms          : [2] Uint4B  : 204 (expand), 208 (compact)
    ///    +0x0d4 gen_condemn_reasons : Uint4B      : 212
    ///    +0x0d8 heap_index          : Uint4B      : 216
    ///  
    ///    clrInstanceId              : byte        : 220
    /// 
    /// Version 0, PreciseVersion 0.2: .NET 4.0
    /// 0:000> dt -r2 clr!WKS::gc_history_per_heap
    ///    +0x000 gen_data         : [5] WKS::gc_generation_data
    ///       +0x000 size_before      : Uint4B/8B      : [0 - 40), [40 - 80), [80 - 120), [120 - 160), [160 - 200)
    ///       +0x004 size_after       : Uint4B/8B
    ///       +0x008 current_size     : Uint4B/8B
    ///       +0x00c previous_size    : Uint4B/8B
    ///       +0x010 fragmentation    : Uint4B/8B
    ///       +0x014 in               : Uint4B/8B
    ///       +0x018 out              : Uint4B/8B
    ///       +0x01c new_allocation   : Uint4B/8B
    ///       +0x020 surv             : Uint4B/8B
    ///       +0x024 growth           : Uint4B/8B
    ///     +0x0c8 mem_pressure     : Uint4B        : 200
    ///     +0x0cc mechanisms       : [3] Uint4B    : 204 (expand), 208 (compact), 212 (concurrent_compact)
    ///    +0x0d8 gen_condemn_reasons : Uint4B      : 216
    ///    +0x0dc heap_index       : Uint4B         : 220
    ///    
    ///    clrInstanceId              : byte        : 224
    /// 
    /// vm\gcrecord.h
    /// Etw_GCDataPerHeapSpecial(...)
    /// ...
    ///     EventDataDescCreate(EventData[0], gc_data_per_heap, datasize);
    ///     EventDataDescCreate(EventData[1], ClrInstanceId, sizeof(ClrInstanceId));
    /// 
    /// Version 1: ???
    /// 
    /// Version 2, PreciseVersion 2.1: .NET 4.5 (x86)
    /// 0:000> dt -r2 WKS::gc_history_per_heap
    ///  clr!WKS::gc_history_per_heap
    /// +0x000 gen_data         : [5] WKS::gc_generation_data
    ///    +0x000 size_before      : Uint4B/8B         : [0 - 40), [40 - 80), [80 - 120), [120 - 160), [160 - 200)
    ///    +0x004 free_list_space_before : Uint4B/8B
    ///    +0x008 free_obj_space_before : Uint4B/8B
    ///    +0x00c size_after       : Uint4B/8B
    ///    +0x010 free_list_space_after : Uint4B/8B
    ///    +0x014 free_obj_space_after : Uint4B/8B
    ///    +0x018 in               : Uint4B/8B
    ///    +0x01c out              : Uint4B/8B
    ///    +0x020 new_allocation   : Uint4B/8B
    ///    +0x024 surv             : Uint4B/8B
    /// +0x0c8 gen_to_condemn_reasons : WKS::gen_to_condemn_tuning
    ///    +0x000 condemn_reasons_gen : Uint4B          : 200
    ///    +0x004 condemn_reasons_condition : Uint4B    : 204
    /// +0x0d0 mem_pressure     : Uint4B                : 208
    /// +0x0d4 mechanisms       : [2] Uint4B            : 212 (expand), 216 (compact)
    /// +0x0dc heap_index       : Uint4B                : 220
    /// 
    /// vm\gcrecord.h
    /// Etw_GCDataPerHeapSpecial(...)
    /// ...
    ///     EventDataDescCreate(EventData[0], gc_data_per_heap, datasize);
    ///     EventDataDescCreate(EventData[1], ClrInstanceId, sizeof(ClrInstanceId));
    /// 
    /// Version 2, PreciseVersion 2.2: .NET 4.5.2 (x86)
    /// 0:000> dt -r2 WKS::gc_history_per_heap
    ///  clr!WKS::gc_history_per_heap
    /// +0x000 gen_data         : [5] WKS::gc_generation_data
    ///    +0x000 size_before      : Uint4B/8B          : [0 - 40), [40 - 80), [80 - 120), [120 - 160), [160 - 200)
    ///    +0x004 free_list_space_before : Uint4B/8B
    ///    +0x008 free_obj_space_before : Uint4B/8B
    ///    +0x00c size_after       : Uint4B/8B
    ///    +0x010 free_list_space_after : Uint4B/8B
    ///    +0x014 free_obj_space_after : Uint4B/8B
    ///    +0x018 in               : Uint4B/8B
    ///    +0x01c out              : Uint4B/8B
    ///    +0x020 new_allocation   : Uint4B/8B
    ///    +0x024 surv             : Uint4B/8B
    /// +0x0c8 gen_to_condemn_reasons : WKS::gen_to_condemn_tuning
    ///    +0x000 condemn_reasons_gen : Uint4B          : 200
    ///    +0x004 condemn_reasons_condition : Uint4B    : 204
    /// +0x0d0 mem_pressure     : Uint4B                : 208
    /// +0x0d4 mechanisms       : [2] Uint4B            : 212 (expand), 216 (compact)
    /// +0x0dc heap_index       : Uint4B                : 220
    /// +0x0e0 extra_gen0_committed : Uint8B            : 224
    /// 
    /// vm\gcrecord.h
    /// Etw_GCDataPerHeapSpecial(...)
    /// ...
    ///     EventDataDescCreate(EventData[0], gc_data_per_heap, datasize);
    ///     EventDataDescCreate(EventData[1], ClrInstanceId, sizeof(ClrInstanceId));
    /// 
    /// Version 3: .NET 4.6 (x86)
    /// 0:000> dt -r2 WKS::gc_history_per_heap
    /// clr!WKS::gc_history_per_heap
    ///    +0x000 gen_data         : [4]                                
    ///     WKS::gc_generation_data                                     
    ///       +0x000 size_before      : Uint4B/8B                          
    ///       +0x004 free_list_space_before : Uint4B/8B                    
    ///       +0x008 free_obj_space_before : Uint4B/8B                     
    ///       +0x00c size_after       : Uint4B/8B                          
    ///       +0x010 free_list_space_after : Uint4B/8B
    ///       +0x014 free_obj_space_after : Uint4B/8B
    ///       +0x018 in               : Uint4B/8B
    ///       +0x01c pinned_surv      : Uint4B/8B
    ///       +0x020 npinned_surv     : Uint4B/8B
    ///       +0x024 new_allocation   : Uint4B/8B
    ///    +0x0a0 maxgen_size_info : WKS::maxgen_size_increase          
    ///       +0x000 free_list_allocated : Uint4B/8B                       
    ///       +0x004 free_list_rejected : Uint4B/8B                        
    ///       +0x008 end_seg_allocated : Uint4B/8B                         
    ///       +0x00c condemned_allocated : Uint4B/8B                       
    ///       +0x010 pinned_allocated : Uint4B/8B                          
    ///       +0x014 pinned_allocated_advance : Uint4B/8B                  
    ///       +0x018 running_free_list_efficiency : Uint4B/8B              
    ///    +0x0bc gen_to_condemn_reasons : WKS::gen_to_condemn_tuning   
    ///       +0x000 condemn_reasons_gen : Uint4B                       
    ///       +0x004 condemn_reasons_condition : Uint4B                 
    ///    +0x0c4 mechanisms       : [2] Uint4B                         
    ///    +0x0cc machanism_bits   : Uint4B                             
    ///    +0x0d0 heap_index       : Uint4B                             
    ///    +0x0d4 extra_gen0_committed : Uint4B/8B                         
    /// 
    /// pal\src\eventprovider\lttng\eventprovdotnetruntime.cpp
    /// FireEtXplatGCPerHeapHistory_V3(...)
    /// 
    ///      tracepoint(
    ///         DotNETRuntime,
    ///         GCPerHeapHistory_V3,                      x86 offsets
    ///         ClrInstanceID,                          : 0
    ///         (const size_t) FreeListAllocated,       : 2
    ///         (const size_t) FreeListRejected,        : 6
    ///         (const size_t) EndOfSegAllocated,       : 10
    ///         (const size_t) CondemnedAllocated,      : 14
    ///         (const size_t) PinnedAllocated,         : 18
    ///         (const size_t) PinnedAllocatedAdvance,  : 22
    ///         RunningFreeListEfficiency,              : 26
    ///         CondemnReasons0,                        : 30
    ///         CondemnReasons1                         : 34
    ///         );
    ///     tracepoint(
    ///         DotNETRuntime,
    ///         GCPerHeapHistory_V3_1,
    ///         CompactMechanisms,                      : 38
    ///         ExpandMechanisms,                       : 42
    ///         HeapIndex,                              : 46
    ///         (const size_t) ExtraGen0Commit,         : 50
    ///         Count,                                  : 54 (number of WKS::gc_generation_data's)
    ///         Arg15_Struct_Len_,                      : ?? not really sent
    ///         (const int*) Arg15_Struct_Pointer_      : [58 - 98), ...
    ///         );
    /// 
    /// Version 3 is now setup to allow "add to the end" scenarios
    /// 
    /// </summary>
    public sealed class GCPerHeapHistoryTraceData : TraceEvent
    {
        public int ClrInstanceID
        {
            get
            {
                int cid = -1;

                if (Version == 0)
                {
                    cid = GetByteAt(EventDataLength - 1);
                }
                else if (Version == 2)
                {
                    cid = GetByteAt(EventDataLength - 1);
                }
                else if (Version >= 3)
                {
                    cid = GetInt16At(0);
                }
                else
                {
                    Debug.Assert(false, "ClrInstanceId invalid Version : " + Version);
                }

                Debug.Assert(cid >= 0);
                return cid;
            }
        }
        public long FreeListAllocated
        {
            get
            {
                long ret = long.MinValue;

                if (Version >= 3)
                {
                    ret = (long)GetAddressAt(2);
                }
                else
                {
                    Debug.Assert(false, "FreeListAllocated invalid Version : " + Version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasFreeListAllocated { get { return Version >= 3; } }
        public long FreeListRejected
        {
            get
            {
                long ret = long.MinValue;

                if (Version >= 3)
                {
                    ret = (long)GetAddressAt(HostOffset(6, 1));
                }
                else
                {
                    Debug.Assert(false, "FreeListRejected invalid Version : " + Version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasFreeListRejected { get { return Version >= 3; } }
        public long EndOfSegAllocated
        {
            get
            {
                long ret = long.MinValue;

                if (Version >= 3)
                {
                    ret = (long)GetAddressAt(HostOffset(10, 2));
                }
                else
                {
                    Debug.Assert(false, "EndOfSegAllocated invalid Version : " + Version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasEndOfSegAllocated { get { return Version >= 3; } }
        public long CondemnedAllocated
        {
            get
            {
                long ret = long.MinValue;

                if (Version >= 3)
                {
                    ret = (long)GetAddressAt(HostOffset(14, 3));
                }
                else
                {
                    Debug.Assert(false, "CondemnedAllocated invalid Version : " + Version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasCondemnedAllocated { get { return Version >= 3; } }
        public long PinnedAllocated
        {
            get
            {
                long ret = long.MinValue;

                if (Version >= 3)
                {
                    ret = (long)GetAddressAt(HostOffset(18, 4));
                }
                else
                {
                    Debug.Assert(false, "PinnedAllocated invalid Version : " + Version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasPinnedAllocated { get { return Version >= 3; } }
        public long PinnedAllocatedAdvance
        {
            get
            {
                long ret = long.MinValue;

                if (Version >= 3)
                {
                    ret = (long)GetAddressAt(HostOffset(22, 5));
                }
                else
                {
                    Debug.Assert(false, "PinnedAllocatedAdvance invalid Version : " + Version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasPinnedAllocatedAdvance { get { return Version >= 3; } }
        public int RunningFreeListEfficiency
        {
            get
            {
                int ret = int.MinValue;

                if (Version >= 3)
                {
                    ret = GetInt32At(HostOffset(26, 6));
                }
                else
                {
                    Debug.Assert(false, "RunningFreeListEfficiency invalid Version : " + Version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasRunningFreeListEfficiency { get { return Version >= 3; } }
        /// <summary>
        /// Returns the condemned generation number
        /// </summary>
        public int CondemnReasons0
        {
            get
            {
                int ret = int.MinValue;

                if (Version == 0 && (MinorVersion == 0 || MinorVersion == 1))
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData + sizeof(int) * 3);
                }
                else if (Version == 0 && MinorVersion == 2)
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData + sizeof(int) * 4);
                }
                else if (Version == 2)
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData);
                }
                else if (Version >= 3)
                {
                    ret = GetInt32At(HostOffset(30, 6));
                }
                else
                {
                    Debug.Assert(false, "CondenReasons0 invalid Version : " + Version + " " + MinorVersion);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        /// <summary>
        /// Returns the condemned condition
        /// </summary>
        public int CondemnReasons1
        {
            get
            {
                int ret = int.MinValue;

                if (Version == 2)
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData + sizeof(int));
                }
                else if (Version >= 3)
                {
                    ret = GetInt32At(HostOffset(34, 6));
                }
                else
                {
                    Debug.Assert(false, "CondenReasons1 invalid Version : " + Version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasCondemnReasons1 { get { return (Version == 2 || Version >= 3); } }
        public gc_heap_compact_reason CompactMechanisms
        {
            get
            {
                int ret = 0;

                if (Version == 0)
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData + sizeof(int) * 2);
                }
                else if (Version == 2)
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData + sizeof(int) * 4);
                }
                else if (Version >= 3)
                {
                    ret = GetInt32At(HostOffset(38, 6));
                }
                else
                {
                    Debug.Assert(false, "CompactMechanisms invalid Version : " + Version);
                }

                Debug.Assert(ret <= 0);

                return (gc_heap_compact_reason)IndexOfSetBit(ret, (int)gc_heap_compact_reason.max_compact_reasons_count,
                                                                  (int)gc_heap_compact_reason.not_specified);
            }
        }
        public gc_heap_expand_mechanism ExpandMechanisms
        {
            get
            {
                int ret = 0;

                if (Version == 0)
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData + sizeof(int) * 1);
                }
                else if (Version == 2)
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData + sizeof(int) * 3);
                }
                else if (Version >= 3)
                {
                    ret = GetInt32At(HostOffset(42, 6));
                }
                else
                {
                    Debug.Assert(false, "ExpandMechanisms invalid Version : " + Version);
                }

                Debug.Assert(ret <= 0);

                return (gc_heap_expand_mechanism)IndexOfSetBit(ret, (int)gc_heap_expand_mechanism.max_expand_mechanisms_count,
                                                                    (int)gc_heap_expand_mechanism.not_specified);
            }
        }
        public gc_concurrent_compact_reason ConcurrentCompactMechanisms
        {
            get
            {
                int ret = 0;

                if (Version == 0 && MinorVersion == 2)
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData + sizeof(int) * 3);
                }
                else
                {
                    Debug.Assert(false, "ConcurrentCompactMechanisms invalid Version : " + Version + " " + MinorVersion);
                }

                Debug.Assert(ret <= 0);

                return (gc_concurrent_compact_reason)IndexOfSetBit(ret, (int)gc_concurrent_compact_reason.max_concurrent_compat_reason,
                                                                        (int)gc_concurrent_compact_reason.not_specified);
            }
        }
        public bool HasConcurrentCompactMechanisms { get { return Version == 0 && MinorVersion == 2; } }
        public int HeapIndex
        {
            get
            {
                int ret = int.MinValue;

                if (Version == 0)
                {
                    ret = GetInt32At(EventDataLength - (sizeof(int) + sizeof(byte)));
                }
                else if (Version == 2 && (MinorVersion == 0 || MinorVersion == 1))
                {
                    ret = GetInt32At(EventDataLength - (sizeof(int) + sizeof(Int16)));
                }
                else if (Version == 2 && MinorVersion == 2)
                {
                    ret = GetInt32At(EventDataLength - (sizeof(int) + sizeof(Int16) + sizeof(Int64)));
                }
                else if (Version >= 3)
                {
                    ret = GetInt32At(HostOffset(46, 6));
                }
                else
                {
                    Debug.Assert(false, "HeapIndex invalid Version : " + Version + " " + MinorVersion);
                }

                Debug.Assert(ret >= 0);
                if (Version >= 0 && Version < 3)
                {
                    Debug.Assert(ret < maxGenData);
                }
                else if (Version >= 3)
                {
                    Debug.Assert(ret < Environment.ProcessorCount); // This is really GCGlobalHeapHistoryTraceData.NumHeaps, but we don't have access to that here
                                                                    // It is VERY unlikely that we make more heaps than there are processors.   
                }

                if (ret < 0)
                {
                    return 0; // on retail avoid array out of range exceptions
                }
                else
                {
                    return ret;
                }
            }
        }
        public long ExtraGen0Commit
        {
            get
            {
                long ret = -1;

                if (Version == 2 && MinorVersion == 2)
                {
                    ret = GetInt32At(EventDataLength - (sizeof(Int16) + sizeof(Int64)));
                }
                else if (Version >= 3)
                {
                    ret = (long)GetAddressAt(HostOffset(50, 6));
                }
                else
                {
                    Debug.Assert(false, "ExtraGen0Commit invalid Version : " + Version + " " + MinorVersion);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasExtraGen0Commit { get { return (Version == 2 && MinorVersion == 2) || Version >= 3; } }
        public int Count
        {
            get
            {
                int ret = int.MinValue;

                if (Version >= 3)
                {
                    ret = GetInt32At(HostOffset(54, 7));
                }
                else
                {
                    Debug.Assert(false, "Count invalid Version : " + Version);
                }

                Debug.Assert(ret >= 0);

                if (ret < 0)
                {
                    return 0; // on retail avoid array out of range exceptions
                }
                else
                {
                    return ret;
                }
            }
        }
        public bool HasCount { get { return Version >= 3; } }
        public int MemoryPressure
        {
            get
            {
                int ret = int.MinValue;

                if (Version == 0)
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData);
                }
                else if (Version == 2)
                {
                    ret = GetInt32At(SizeOfGenData * maxGenData + sizeof(Int32) * 2);
                }
                else
                {
                    Debug.Assert(false, "MemoryPressure invalid Version : " + Version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasMemoryPressure { get { return Version == 0 || Version == 2; } }

        /// <summary>
        /// genNumber is a number from 0 to maxGenData-1.  These are for generation 0, 1, 2, 3 = Large Object Heap
        /// genNumber = 4 is that second pass for Gen 0.  
        /// </summary>
        public GCPerHeapHistoryGenData GenData(Gens genNumber)
        {
            if (Version == 0 || Version == 2)
            {
                Debug.Assert((int)genNumber < maxGenData);
                // each GenData structure contains 10 pointers sized integers 
                return new GCPerHeapHistoryGenData(Version, GetIntPtrArray(SizeOfGenData * (int)genNumber, EntriesInGenData));
            }
            else if (Version >= 3)
            {
                Debug.Assert((int)genNumber < Count);
                return new GCPerHeapHistoryGenData(Version, GetIntPtrArray((HostOffset(54, 7) + sizeof(Int32)) + SizeOfGenData * (int)genNumber, EntriesInGenData));
            }
            else
            {
                Debug.Assert(false, "GenData invalid Version : " + Version);
                return new GCPerHeapHistoryGenData(Version, GetIntPtrArray(SizeOfGenData * (int)genNumber, EntriesInGenData));
            }
        }

        public bool VersionRecognized { get { int ver; return ParseMinorVersion(out ver); } }

        #region Private
        public int MinorVersion
        {
            get
            {
                if (m_minorVersion == -1)
                {
                    ParseMinorVersion(out m_minorVersion);
                }

                return m_minorVersion;
            }
        }
        private int m_minorVersion = -1;
        private bool ParseMinorVersion(out int mversion)
        {
            mversion = -1;
            int size = 0;
            bool exactMatch = false;

            if (Version == 0)
            {
                size = (SizeOfGenData * 5) + 25;
                // For silverlight, there is one less mechanism.  It only affects the layout of gen_condemended_reasons. 
                if (base.EventDataLength == (size - sizeof(int)))
                {
                    mversion = 1; // Silverlight
                }
                else if (base.EventDataLength == size)
                {
                    mversion = 2; // .NET 4.0
                }

                if (mversion > 0)
                {
                    exactMatch = true;
                }
                else
                {
                    mversion = 0;
                }
            }
            else if (Version == 2)
            {
                size = (SizeOfGenData * 5) + sizeof(Int32) * 6 + sizeof(byte) + sizeof(Int64);
                if (base.EventDataLength == (size - sizeof(Int64)))
                {
                    mversion = 1; // .NET 4.5
                }
                else if (base.EventDataLength == size)
                {
                    mversion = 2; // .NET 4.5.2
                }

                if (mversion > 0)
                {
                    exactMatch = true;
                }
                else
                {
                    mversion = 0;
                }
            }
            else if (Version >= 3)
            {
                size = sizeof(Int16) + HostSizePtr(7) + sizeof(Int32) * 7 + SizeOfGenData * 4;
                // set this check up to enable future versions that "add to the end"
                if (base.EventDataLength >= size)
                {
                    mversion = 0; // .NET 4.6+
                }

                if (mversion >= 0)
                {
                    exactMatch = true;
                }
                else
                {
                    mversion = 0;
                }
            }

            Debug.Assert(exactMatch, "Unrecognized version (" + Version + ") and stream size (" + base.EventDataLength + ") not equal to expected (" + size + ")");

            return exactMatch;
        }

        private int IndexOfSetBit(int pow2, int count, int notSpecifiedValue)
        {
            if (pow2 == 0)
                return notSpecifiedValue;
            int index = 0;
            while ((pow2 & 1) != 1)
            {
                pow2 >>= 1;
                index++;
            }

            if (index >= 0 && index < count)
                return index;
            Debug.Assert(false, index + " >= 0 && " + index + " < " + count);
            return notSpecifiedValue;
        }

        private long[] GetIntPtrArray(int offset, int count)
        {
            long[] arr = new long[count];
            for (int i = 0; i < count; i++)
            {
                arr[i] = GetIntPtrAt(offset);
                offset += base.HostSizePtr(1);
            }

            return arr;
        }

        private const int maxGenData = (int)Gens.Gen0After + 1;

        internal GCPerHeapHistoryTraceData(Delegate action, int eventID, int task, string taskName, Guid taskGuid, int opcode, string opcodeName, Guid providerGuid, string providerName)
            : base(eventID, task, taskName, taskGuid, opcode, opcodeName, providerGuid, providerName)
        {
            Action = action;
        }
        protected internal override void Dispatch()
        {
            ((Action<GCPerHeapHistoryTraceData>)Action)(this);
        }
        protected internal override Delegate Target
        {
            get { return Action; }
            set { Action = value; }
        }
        protected internal override void Validate()
        {
            Debug.Assert(VersionRecognized);
        }

        public int EntriesInGenData
        {
            get
            {
                return 10;
            }
        }

        public int SizeOfGenData
        {
            get
            {
                return base.HostSizePtr(EntriesInGenData);
            }
        }

        public override StringBuilder ToXml(StringBuilder sb)
        {
            Prefix(sb);
            XmlAttrib(sb, "ClrInstanceID", ClrInstanceID);
            if (HasFreeListAllocated)
            {
                XmlAttrib(sb, "FreeListAllocated", FreeListAllocated);
            }

            if (HasFreeListRejected)
            {
                XmlAttrib(sb, "FreeListRejected", FreeListRejected);
            }

            if (HasEndOfSegAllocated)
            {
                XmlAttrib(sb, "EndOfSegAllocated", EndOfSegAllocated);
            }

            if (HasCondemnedAllocated)
            {
                XmlAttrib(sb, "CondemnedAllocated", CondemnedAllocated);
            }

            if (HasPinnedAllocated)
            {
                XmlAttrib(sb, "PinnedAllocated", PinnedAllocated);
            }

            if (HasPinnedAllocatedAdvance)
            {
                XmlAttrib(sb, "PinnedAllocatedAdvance", PinnedAllocatedAdvance);
            }

            if (HasRunningFreeListEfficiency)
            {
                XmlAttrib(sb, "RunningFreeListEfficiency", RunningFreeListEfficiency);
            }

            XmlAttrib(sb, "CondemnReasons0", CondemnReasons0);
            if (HasCondemnReasons1)
            {
                XmlAttrib(sb, "CondemnReasons1", CondemnReasons1);
            }

            XmlAttrib(sb, "CompactMechanisms", CompactMechanisms);
            XmlAttrib(sb, "ExpandMechanisms", ExpandMechanisms);
            if (HasConcurrentCompactMechanisms)
            {
                XmlAttrib(sb, "ConcurrentCompactMechanisms", ConcurrentCompactMechanisms);
            }

            XmlAttrib(sb, "HeapIndex", HeapIndex);
            if (HasExtraGen0Commit)
            {
                XmlAttrib(sb, "ExtraGen0Commit", ExtraGen0Commit);
            }

            if (HasCount)
            {
                XmlAttrib(sb, "Count", Count);
            }

            if (HasMemoryPressure)
            {
                XmlAttrib(sb, "MemoryPressure", MemoryPressure);
            }

            sb.Append("/>");
            // @TODO the upper bound is not right for >= 3
            for (var gens = Gens.Gen0; gens <= Gens.GenLargeObj; gens++)
            {
                GenData(gens).ToXml(gens, sb).AppendLine();
            }

            sb.AppendLine("</Event>");

            return sb;
        }

        public override string[] PayloadNames
        {
            get
            {
                if (payloadNames == null)
                {
                    payloadNames = new string[] {"ClrInstanceID", "FreeListAllocated", "FreeListRejected", "EndOfSegAllocated", "CondemnedAllocated"
                        , "PinnedAllocated", "PinnedAllocatedAdvance", "RunningFreeListEfficiency", "CondemnReasons0", "CondemnReasons1", "CompactMechanisms", "ExpandMechanisms"
                        , "ConcurrentCompactMechanisms", "HeapIndex", "ExtraGen0Commit", "Count", "MemoryPressure"
                    };
                }
                return payloadNames;
            }
        }

        public override object PayloadValue(int index)
        {
            switch (index)
            {
                case 0:
                    return ClrInstanceID;
                case 1:
                    if (HasFreeListAllocated)
                    {
                        return FreeListAllocated;
                    }

                    return null;
                case 2:
                    if (HasFreeListRejected)
                    {
                        return FreeListRejected;
                    }

                    return null;
                case 3:
                    if (HasEndOfSegAllocated)
                    {
                        return EndOfSegAllocated;
                    }

                    return null;
                case 4:
                    if (HasCondemnedAllocated)
                    {
                        return CondemnedAllocated;
                    }
                    else
                    {
                        return null;
                    }

                case 5:
                    if (HasPinnedAllocated)
                    {
                        return PinnedAllocated;
                    }
                    else
                    {
                        return null;
                    }

                case 6:
                    if (HasPinnedAllocatedAdvance)
                    {
                        return PinnedAllocatedAdvance;
                    }
                    else
                    {
                        return null;
                    }

                case 7:
                    if (HasRunningFreeListEfficiency)
                    {
                        return RunningFreeListEfficiency;
                    }
                    else
                    {
                        return null;
                    }

                case 8:
                    return CondemnReasons0;
                case 9:
                    if (HasCondemnReasons1)
                    {
                        return CondemnReasons1;
                    }
                    else
                    {
                        return null;
                    }

                case 10:
                    return CompactMechanisms;
                case 11:
                    return ExpandMechanisms;
                case 12:
                    if (HasConcurrentCompactMechanisms)
                    {
                        return ConcurrentCompactMechanisms;
                    }
                    else
                    {
                        return null;
                    }

                case 13:
                    return HeapIndex;
                case 14:
                    if (HasExtraGen0Commit)
                    {
                        return ExtraGen0Commit;
                    }
                    else
                    {
                        return null;
                    }

                case 15:
                    if (HasCount)
                    {
                        return Count;
                    }
                    else
                    {
                        return null;
                    }

                case 16:
                    if (HasMemoryPressure)
                    {
                        return MemoryPressure;
                    }
                    else
                    {
                        return null;
                    }

                default:
                    Debug.Assert(false, "Bad field index");
                    return null;
            }
        }

        private Delegate Action;
        #endregion
    }

    public enum GCExpandMechanism : uint
    {
        None = 0,
        ReuseNormal = 0x80000000,
        ReuseBestFit = 0x80000001,
        NewSegEphemeralPromotion = 0x80000002,
        NewSeg = 0x80000003,
        NoMemory = 0x80000004,
    };

    /// <summary>
    /// Version 0: Silverlight (x86), .NET 4.0
    /// [5] WKS::gc_generation_data
    ///    +0x000 size_before      : Uint4B/8B
    ///    +0x004 size_after       : Uint4B/8B
    ///    +0x008 current_size     : Uint4B/8B
    ///    +0x00c previous_size    : Uint4B/8B
    ///    +0x010 fragmentation    : Uint4B/8B
    ///    +0x014 in               : Uint4B/8B
    ///    +0x018 out              : Uint4B/8B
    ///    +0x01c new_allocation   : Uint4B/8B
    ///    +0x020 surv             : Uint4B/8B
    ///    +0x024 growth           : Uint4B/8B
    ///    
    /// Version 1: ???
    /// 
    /// Version 2, PreciseVersion 2.1: .NET 4.5 (x86), .NET 4.5.2 (x86)
    ///  [5] WKS::gc_generation_data
    ///    +0x000 size_before            : Uint4B/8B
    ///    +0x004 free_list_space_before : Uint4B/8B
    ///    +0x008 free_obj_space_before  : Uint4B/8B
    ///    +0x00c size_after             : Uint4B/8B
    ///    +0x010 free_list_space_after  : Uint4B/8B
    ///    +0x014 free_obj_space_after   : Uint4B/8B
    ///    +0x018 in                     : Uint4B/8B
    ///    +0x01c out                    : Uint4B/8B
    ///    +0x020 new_allocation         : Uint4B/8B
    ///    +0x024 surv                   : Uint4B/8B
    /// 
    /// Version 3: .NET 4.6 (x86)
    /// [4] WKS::gc_generation_data                                     
    ///    +0x000 size_before            : Uint4B/8B                          
    ///    +0x004 free_list_space_before : Uint4B/8B                    
    ///    +0x008 free_obj_space_before  : Uint4B/8B                     
    ///    +0x00c size_after             : Uint4B/8B                          
    ///    +0x010 free_list_space_after  : Uint4B/8B
    ///    +0x014 free_obj_space_after   : Uint4B/8B
    ///    +0x018 in                     : Uint4B/8B
    ///    +0x01c pinned_surv            : Uint4B/8B
    ///    +0x020 npinned_surv           : Uint4B/8B
    ///    +0x024 new_allocation         : Uint4B/8B
    /// </summary>
    public sealed class GCPerHeapHistoryGenData
    {
        /// <summary>
        /// Size of the generation before the GC, includes fragmentation
        /// </summary>
        public long SizeBefore
        {
            get
            {
                long ret = m_genDataArray[0];

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        /// <summary>
        /// Size of the generation after GC.  Includes fragmentation
        /// </summary>
        public long SizeAfter
        {
            get
            {
                long ret = long.MinValue;

                if (m_version == 0)
                {
                    ret = m_genDataArray[1];
                }
                else if (m_version >= 2)
                {
                    ret = m_genDataArray[3];
                }
                else
                {
                    Debug.Assert(false, "SizeAfter invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        /// <summary>
        /// Size occupied by objects at the beginning of the GC, discounting fragmentation. 
        /// Only exits on 4.5 RC and beyond.
        /// </summary>
        public long ObjSpaceBefore
        {
            get
            {
                long ret = long.MinValue;

                if (m_version >= 2)
                {
                    ret = (SizeBefore - FreeListSpaceBefore - FreeObjSpaceBefore);
                }
                else
                {
                    Debug.Assert(false, "ObjSpaceBefore invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasObjSpaceBefore { get { return m_version >= 2; } }
        /// <summary>
        /// This is the fragmenation at the end of the GC.
        /// </summary>
        public long Fragmentation
        {
            get
            {
                long ret = long.MinValue;

                if (m_version == 0)
                {
                    ret = m_genDataArray[4];
                }
                else if (m_version >= 2)
                {
                    ret = (FreeListSpaceAfter + FreeObjSpaceAfter);
                }
                else
                {
                    Debug.Assert(false, "Fragmentation invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        /// <summary>
        /// Size occupied by objects, discounting fragmentation.
        /// </summary>
        public long ObjSizeAfter
        {
            get
            {
                long ret = SizeAfter - Fragmentation;

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        /// <summary>
        /// This is the free list space (ie, what's threaded onto the free list) at the beginning of the GC.
        /// Only exits on 4.5 RC and beyond.
        /// </summary>
        public long FreeListSpaceBefore
        {
            get
            {
                long ret = long.MinValue;

                if (m_version >= 2)
                {
                    ret = m_genDataArray[1];
                }
                else
                {
                    Debug.Assert(false, "FreeListSpaceBefore invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasFreeListSpaceBefore { get { return m_version >= 2; } }
        /// <summary>
        /// This is the free obj space (ie, what's free but not threaded onto the free list) at the beginning of the GC.
        /// Only exits on 4.5 RC and beyond.
        /// </summary>
        public long FreeObjSpaceBefore
        {
            get
            {
                long ret = long.MinValue;
                if (m_version >= 2)
                {
                    ret = m_genDataArray[2];
                }
                else
                {
                    Debug.Assert(false, "FreeObjSpaceBefore invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasFreeObjSpaceBefore { get { return m_version >= 2; } }
        /// <summary>
        /// This is the free list space (ie, what's threaded onto the free list) at the end of the GC.
        /// Only exits on 4.5 Beta and beyond.
        /// </summary>
        public long FreeListSpaceAfter
        {
            get
            {
                long ret = long.MinValue;
                if (m_version >= 2)
                {
                    ret = m_genDataArray[4];
                }
                else
                {
                    Debug.Assert(false, "FreeListSpaceAfter invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasFreeListSpaceAfter { get { return m_version >= 2; } }
        /// <summary>
        /// This is the free obj space (ie, what's free but not threaded onto the free list) at the end of the GC.
        /// Only exits on 4.5 Beta and beyond.
        /// </summary>
        public long FreeObjSpaceAfter
        {
            get
            {
                long ret = long.MinValue;

                if (m_version >= 2)
                {
                    ret = m_genDataArray[5];
                }
                else
                {
                    Debug.Assert(false, "FreeObjSpaceAfter invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasFreeObjSpaceAfter { get { return m_version >= 2; } }
        /// <summary>
        /// This is the amount that came into this generation on this GC
        /// </summary>
        public long In
        {
            get
            {
                long ret = long.MinValue;

                if (m_version == 0)
                {
                    ret = m_genDataArray[5];
                }
                else if (m_version >= 2)
                {
                    ret = m_genDataArray[6];
                }
                else
                {
                    Debug.Assert(false, "In invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        /// <summary>
        /// This is the number of bytes survived in this generation.
        /// </summary>
        public long Out
        {
            get
            {
                long ret = long.MinValue;

                if (m_version == 0)
                {
                    ret = m_genDataArray[6];
                }
                else if (m_version == 2)
                {
                    ret = m_genDataArray[7];
                }
                else if (m_version >= 3)
                {
                    ret = (PinnedSurv + NonePinnedSurv);
                }
                else
                {
                    Debug.Assert(false, "Out invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        /// <summary>
        /// This is the new budget for the generation
        /// </summary>
        public long Budget
        {
            get
            {
                long ret = long.MinValue;

                if (m_version == 0)
                {
                    ret = m_genDataArray[7];
                }
                else if (m_version == 2)
                {
                    ret = m_genDataArray[8];
                }
                else if (m_version >= 3)
                {
                    ret = m_genDataArray[9];
                }
                else
                {
                    Debug.Assert(false, "Budget invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        /// <summary>
        /// This is the survival rate
        /// </summary>
        public long SurvRate
        {
            get
            {
                long ret = long.MinValue;

                if (m_version == 0)
                {
                    ret = m_genDataArray[8];
                }
                else if (m_version == 2)
                {
                    ret = m_genDataArray[9];
                }
                else if (m_version >= 3)
                {
                    if (ObjSpaceBefore == 0)
                    {
                        ret = 0;
                    }
                    else
                    {
                        ret = (long)((double)Out * 100.0 / (double)ObjSpaceBefore);
                    }
                }
                else
                {
                    Debug.Assert(false, "SurvRate invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }

        public long PinnedSurv
        {
            get
            {
                long ret = long.MinValue;

                if (m_version >= 3)
                {
                    ret = m_genDataArray[7];
                }
                else
                {
                    Debug.Assert(false, "PinnedSurv invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasPinnedSurv { get { return (m_version >= 3); } }
        public long NonePinnedSurv
        {
            get
            {
                long ret = long.MinValue;

                if (m_version >= 3)
                {
                    ret = m_genDataArray[8];
                }
                else
                {
                    Debug.Assert(false, "NonePinnedSurv invalid version : " + m_version);
                }

                Debug.Assert(ret >= 0);
                return ret;
            }
        }
        public bool HasNonePinnedSurv { get { return (m_version >= 3); } }

        public StringBuilder ToXml(Gens genName, StringBuilder sb)
        {
            sb.Append(" <GenData");
            TraceEvent.XmlAttrib(sb, "Name", genName);
            TraceEvent.XmlAttrib(sb, "SizeBefore", SizeBefore);
            TraceEvent.XmlAttrib(sb, "SizeAfter", SizeAfter);
            if (HasObjSpaceBefore)
            {
                TraceEvent.XmlAttrib(sb, "ObjSpaceBefore", ObjSpaceBefore);
            }

            TraceEvent.XmlAttrib(sb, "Fragmentation", Fragmentation);
            TraceEvent.XmlAttrib(sb, "ObjSizeAfter", ObjSizeAfter);
            if (HasFreeListSpaceBefore)
            {
                TraceEvent.XmlAttrib(sb, "FreeListSpaceBefore", FreeListSpaceBefore);
            }

            if (HasFreeObjSpaceBefore)
            {
                TraceEvent.XmlAttrib(sb, "FreeObjSpaceBefore", FreeObjSpaceBefore);
            }

            if (HasFreeListSpaceAfter)
            {
                TraceEvent.XmlAttrib(sb, "FreeListSpaceAfter", FreeListSpaceAfter);
            }

            if (HasFreeObjSpaceAfter)
            {
                TraceEvent.XmlAttrib(sb, "FreeObjSpaceAfter", FreeObjSpaceAfter);
            }

            TraceEvent.XmlAttrib(sb, "In", In);
            TraceEvent.XmlAttrib(sb, "Out", Out);
            TraceEvent.XmlAttrib(sb, "NewAllocation", Budget); // not sure why this is not called Budget
            TraceEvent.XmlAttrib(sb, "SurvRate", SurvRate);
            if (HasPinnedSurv)
            {
                TraceEvent.XmlAttrib(sb, "PinnedSurv", PinnedSurv);
            }

            if (HasNonePinnedSurv)
            {
                TraceEvent.XmlAttrib(sb, "NonePinnedSurv", NonePinnedSurv);
            }

            sb.Append("/>");
            return sb;
        }
        public override string ToString()
        {
            return ToXml(Gens.Gen0, new StringBuilder()).ToString();
        }
        #region private
        internal GCPerHeapHistoryGenData(int version, long[] genDataArray)
        {
            m_version = version;
            m_genDataArray = genDataArray;
        }

        private int m_version;
        private long[] m_genDataArray;
        #endregion
    }

    /// <summary>
    /// Version 0: ???
    /// 
    /// Version 1: Silverlight (x86), .NET 4.0, .NET 4.5, .NET 4.5.2
    /// VM\gc.cpp
    /// 0:041> dt -r3 WKS::gc_history_global
    /// coreclr!WKS::gc_history_global
    ///    +0x000 final_youngest_desired : Uint4B/8B
    ///    +0x004 num_heaps        : Uint4B
    ///    +0x008 condemned_generation : Int4B
    ///    +0x00c gen0_reduction_count : Int4B
    ///    +0x010 reason           : 
    ///     reason_alloc_soh = 0n0
    ///     reason_induced = 0n1
    ///     reason_lowmemory = 0n2
    ///     reason_empty = 0n3
    ///     reason_alloc_loh = 0n4
    ///     reason_oos_soh = 0n5
    ///     reason_oos_loh = 0n6
    ///     reason_induced_noforce = 0n7
    ///     reason_gcstress = 0n8
    ///     reason_max = 0n9
    ///    +0x014 global_mechanims_p : Uint4B
    ///   
    /// FireEtwGCGlobalHeapHistory_V1(gc_data_global.final_youngest_desired, // upcast on 32bit to __int64
    ///                          gc_data_global.num_heaps,
    ///                          gc_data_global.condemned_generation,
    ///                          gc_data_global.gen0_reduction_count,
    ///                          gc_data_global.reason,
    ///                          gc_data_global.global_mechanims_p,
    ///                          GetClrInstanceId());
    /// Version 2: .NET 4.6
    /// clr!WKS::gc_history_global
    ///    +0x000 final_youngest_desired : Uint4B/8B
    ///    +0x004 num_heaps        : Uint4B
    ///    +0x008 condemned_generation : Int4B
    ///    +0x00c gen0_reduction_count : Int4B
    ///    +0x010 reason           : 
    ///     reason_alloc_soh = 0n0
    ///     reason_induced = 0n1
    ///     reason_lowmemory = 0n2
    ///     reason_empty = 0n3
    ///     reason_alloc_loh = 0n4
    ///     reason_oos_soh = 0n5
    ///     reason_oos_loh = 0n6
    ///     reason_induced_noforce = 0n7
    ///     reason_gcstress = 0n8
    ///     reason_lowmemory_blocking = 0n9
    ///     reason_induced_compacting = 0n10
    ///     reason_lowmemory_host = 0n11
    ///     reason_max = 0n12
    ///    +0x014 pause_mode       : Int4B
    ///    +0x018 mem_pressure     : Uint4B
    ///    +0x01c global_mechanims_p : Uint4B
    /// 
    /// FireEtwGCGlobalHeapHistory_V2(gc_data_global.final_youngest_desired, // upcast on 32bit to __int64
    ///                          gc_data_global.num_heaps,
    ///                          gc_data_global.condemned_generation,
    ///                          gc_data_global.gen0_reduction_count,
    ///                          gc_data_global.reason,
    ///                          gc_data_global.global_mechanims_p,
    ///                          GetClrInstanceId());
    ///                          gc_data_global.pause_mode, 
    ///                          gc_data_global.mem_pressure);
    ///                          
    /// </summary>
    public sealed class GCGlobalHeapHistoryTraceData : TraceEvent
    {
        public long FinalYoungestDesired { get { return GetInt64At(0); } }
        public int NumHeaps { get { return GetInt32At(8); } }
        public int CondemnedGeneration { get { return GetInt32At(12); } }
