<?xml version="1.0"?>
<doc>
    <assembly>
        <name>Microsoft.Diagnostics.Tracing.TraceEvent</name>
    </assembly>
    <members>
        <member name="T:Microsoft.Diagnostics.Utilities.DirectoryUtilities">
            <summary>
            General purpose utilities dealing with archiveFile system directories. 
            </summary>
        </member>
        <member name="M:Microsoft.Diagnostics.Utilities.DirectoryUtilities.Copy(System.String,System.String)">
            <summary>
            SafeCopy sourceDirectory to directoryToVersion recursively. The target directory does
            no need to exist
            </summary>
        </member>
        <member name="M:Microsoft.Diagnostics.Utilities.DirectoryUtilities.Copy(System.String,System.String,System.IO.SearchOption)">
            <summary>
            SafeCopy all files from sourceDirectory to directoryToVersion.  If searchOptions == AllDirectories
            then the copy is recursive, otherwise it is just one level.  The target directory does not
            need to exist. 
            </summary>
        </member>
        <member name="M:Microsoft.Diagnostics.Utilities.DirectoryUtilities.Clean(System.String)">
            <summary>
            Clean is sort of a 'safe' recursive delete of a directory.  It either deletes the
            files or moves them to '*.deleting' names.  It deletes directories that are completely

        <member name="M:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCBulkEdgeTraceData.Values(System.Int32)">
            <summary>
            Returns the 'idx' th edge.  
            The returned GCBulkEdgeEdges cannot live beyond the TraceEvent that it comes from.  
            </summary>
        </member>
        <member name="T:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCBulkEdgeValues">
            <summary>
            This structure just POINTS at the data in the GCBulkNodeTraceData.  It can only be used as long as
            the GCBulkNodeTraceData is alive which (unless you cloned it) is only for the lifetime of the callback.  
            </summary>
        </member>
        <member name="M:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCBulkSurvivingObjectRangesTraceData.Values(System.Int32)">
            <summary>
            Returns the range at the given zero-based index (index less than Count).   The returned GCBulkSurvivingObjectRangesValues 
            points the the data in GCBulkSurvivingObjectRangesTraceData so it cannot live beyond that lifetime.  
            </summary>
        </member>
        <member name="T:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCBulkSurvivingObjectRangesValues">
            <summary>
            This structure just POINTS at the data in the GCBulkEdgeTraceData.  It can only be used as long as
            the GCBulkEdgeTraceData is alive which (unless you cloned it) is only for the lifetime of the callback.  
            </summary>
        </member>
        <member name="M:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCBulkMovedObjectRangesTraceData.Values(System.Int32)">
            <summary>
            Returns the range at the given zero-based index (index less than Count).   The returned GCBulkSurvivingObjectRangesValues 
            points the the data in GCBulkSurvivingObjectRangesTraceData so it cannot live beyond that lifetime.  
            </summary>
        </member>
        <member name="T:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCBulkMovedObjectRangesValues">
            <summary>
            This structure just POINTS at the data in the GCBulkEdgeTraceData.  It can only be used as long as
            the GCBulkEdgeTraceData is alive which (unless you cloned it) is only for the lifetime of the callback.  
            </summary>
        </member>
        <member name="T:Microsoft.Diagnostics.Tracing.Parsers.Clr.Gens">
            <summary>
            We keep Heap history for every Generation in 'Gens' 
            </summary>
        </member>
        <member name="T:Microsoft.Diagnostics.Tracing.Parsers.Clr.gc_heap_expand_mechanism">
            <summary>
            Taken from gcrecords.h, used to differentiate heap expansion and compaction reasons
            </summary>
        </member>
        <member name="T:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryTraceData">
            <summary>
            Version 0, PreciseVersion 0.1: Silverlight (x86)
            0:041> dt -r2 coreclr!WKS::gc_history_per_heap
               +0x000 gen_data         : [5] WKS::gc_generation_data
                  +0x000 size_before      : Uint4B/8B       : [0 - 40), [40 - 80), [80 - 120), [120 - 160), [160 - 200)
                  +0x004 size_after       : Uint4B/8B
                  +0x008 current_size     : Uint4B/8B
                  +0x00c previous_size    : Uint4B/8B
                  +0x010 fragmentation    : Uint4B/8B
                  +0x014 in               : Uint4B/8B
                  +0x018 out              : Uint4B/8B
                  +0x01c new_allocation   : Uint4B/8B
                  +0x020 surv             : Uint4B/8B
                  +0x024 growth           : Uint4B/8B
               +0x0c8 mem_pressure        : Uint4B      : 200
               +0x0cc mechanisms          : [2] Uint4B  : 204 (expand), 208 (compact)
               +0x0d4 gen_condemn_reasons : Uint4B      : 212
               +0x0d8 heap_index          : Uint4B      : 216
             
               clrInstanceId              : byte        : 220
            
            Version 0, PreciseVersion 0.2: .NET 4.0
            0:000> dt -r2 clr!WKS::gc_history_per_heap
               +0x000 gen_data         : [5] WKS::gc_generation_data
                  +0x000 size_before      : Uint4B/8B      : [0 - 40), [40 - 80), [80 - 120), [120 - 160), [160 - 200)
                  +0x004 size_after       : Uint4B/8B
                  +0x008 current_size     : Uint4B/8B
                  +0x00c previous_size    : Uint4B/8B
                  +0x010 fragmentation    : Uint4B/8B
                  +0x014 in               : Uint4B/8B
                  +0x018 out              : Uint4B/8B
                  +0x01c new_allocation   : Uint4B/8B
                  +0x020 surv             : Uint4B/8B
                  +0x024 growth           : Uint4B/8B
                +0x0c8 mem_pressure     : Uint4B        : 200
                +0x0cc mechanisms       : [3] Uint4B    : 204 (expand), 208 (compact), 212 (concurrent_compact)
               +0x0d8 gen_condemn_reasons : Uint4B      : 216
               +0x0dc heap_index       : Uint4B         : 220
               
               clrInstanceId              : byte        : 224
            
            vm\gcrecord.h
            Etw_GCDataPerHeapSpecial(...)
            ...
                EventDataDescCreate(EventData[0], gc_data_per_heap, datasize);
                EventDataDescCreate(EventData[1], ClrInstanceId, sizeof(ClrInstanceId));
            
            Version 1: ???
            
            Version 2, PreciseVersion 2.1: .NET 4.5 (x86)
            0:000> dt -r2 WKS::gc_history_per_heap
             clr!WKS::gc_history_per_heap
            +0x000 gen_data         : [5] WKS::gc_generation_data
               +0x000 size_before      : Uint4B/8B         : [0 - 40), [40 - 80), [80 - 120), [120 - 160), [160 - 200)
               +0x004 free_list_space_before : Uint4B/8B
               +0x008 free_obj_space_before : Uint4B/8B
               +0x00c size_after       : Uint4B/8B
               +0x010 free_list_space_after : Uint4B/8B
               +0x014 free_obj_space_after : Uint4B/8B
               +0x018 in               : Uint4B/8B
               +0x01c out              : Uint4B/8B
               +0x020 new_allocation   : Uint4B/8B
               +0x024 surv             : Uint4B/8B
            +0x0c8 gen_to_condemn_reasons : WKS::gen_to_condemn_tuning
               +0x000 condemn_reasons_gen : Uint4B          : 200
               +0x004 condemn_reasons_condition : Uint4B    : 204
            +0x0d0 mem_pressure     : Uint4B                : 208
            +0x0d4 mechanisms       : [2] Uint4B            : 212 (expand), 216 (compact)
            +0x0dc heap_index       : Uint4B                : 220
            
            vm\gcrecord.h
            Etw_GCDataPerHeapSpecial(...)
            ...
                EventDataDescCreate(EventData[0], gc_data_per_heap, datasize);
                EventDataDescCreate(EventData[1], ClrInstanceId, sizeof(ClrInstanceId));
            
            Version 2, PreciseVersion 2.2: .NET 4.5.2 (x86)
            0:000> dt -r2 WKS::gc_history_per_heap
             clr!WKS::gc_history_per_heap
            +0x000 gen_data         : [5] WKS::gc_generation_data
               +0x000 size_before      : Uint4B/8B          : [0 - 40), [40 - 80), [80 - 120), [120 - 160), [160 - 200)
               +0x004 free_list_space_before : Uint4B/8B
               +0x008 free_obj_space_before : Uint4B/8B
               +0x00c size_after       : Uint4B/8B
               +0x010 free_list_space_after : Uint4B/8B
               +0x014 free_obj_space_after : Uint4B/8B
               +0x018 in               : Uint4B/8B
               +0x01c out              : Uint4B/8B
               +0x020 new_allocation   : Uint4B/8B
               +0x024 surv             : Uint4B/8B
            +0x0c8 gen_to_condemn_reasons : WKS::gen_to_condemn_tuning
               +0x000 condemn_reasons_gen : Uint4B          : 200
               +0x004 condemn_reasons_condition : Uint4B    : 204
            +0x0d0 mem_pressure     : Uint4B                : 208
            +0x0d4 mechanisms       : [2] Uint4B            : 212 (expand), 216 (compact)
            +0x0dc heap_index       : Uint4B                : 220
            +0x0e0 extra_gen0_committed : Uint8B            : 224
            
            vm\gcrecord.h
            Etw_GCDataPerHeapSpecial(...)
            ...
                EventDataDescCreate(EventData[0], gc_data_per_heap, datasize);
                EventDataDescCreate(EventData[1], ClrInstanceId, sizeof(ClrInstanceId));
            
            Version 3: .NET 4.6 (x86)
            0:000> dt -r2 WKS::gc_history_per_heap
            clr!WKS::gc_history_per_heap
               +0x000 gen_data         : [4]                                
                WKS::gc_generation_data                                     
                  +0x000 size_before      : Uint4B/8B                          
                  +0x004 free_list_space_before : Uint4B/8B                    
                  +0x008 free_obj_space_before : Uint4B/8B                     
                  +0x00c size_after       : Uint4B/8B                          
                  +0x010 free_list_space_after : Uint4B/8B
                  +0x014 free_obj_space_after : Uint4B/8B
                  +0x018 in               : Uint4B/8B
                  +0x01c pinned_surv      : Uint4B/8B
                  +0x020 npinned_surv     : Uint4B/8B
                  +0x024 new_allocation   : Uint4B/8B
               +0x0a0 maxgen_size_info : WKS::maxgen_size_increase          
                  +0x000 free_list_allocated : Uint4B/8B                       
                  +0x004 free_list_rejected : Uint4B/8B                        
                  +0x008 end_seg_allocated : Uint4B/8B                         
                  +0x00c condemned_allocated : Uint4B/8B                       
                  +0x010 pinned_allocated : Uint4B/8B                          
                  +0x014 pinned_allocated_advance : Uint4B/8B                  
                  +0x018 running_free_list_efficiency : Uint4B/8B              
               +0x0bc gen_to_condemn_reasons : WKS::gen_to_condemn_tuning   
                  +0x000 condemn_reasons_gen : Uint4B                       
                  +0x004 condemn_reasons_condition : Uint4B                 
               +0x0c4 mechanisms       : [2] Uint4B                         
               +0x0cc machanism_bits   : Uint4B                             
               +0x0d0 heap_index       : Uint4B                             
               +0x0d4 extra_gen0_committed : Uint4B/8B                         
            
            pal\src\eventprovider\lttng\eventprovdotnetruntime.cpp
            FireEtXplatGCPerHeapHistory_V3(...)
            
                 tracepoint(
                    DotNETRuntime,
                    GCPerHeapHistory_V3,                      x86 offsets
                    ClrInstanceID,                          : 0
                    (const size_t) FreeListAllocated,       : 2
                    (const size_t) FreeListRejected,        : 6
                    (const size_t) EndOfSegAllocated,       : 10
                    (const size_t) CondemnedAllocated,      : 14
                    (const size_t) PinnedAllocated,         : 18
                    (const size_t) PinnedAllocatedAdvance,  : 22
                    RunningFreeListEfficiency,              : 26
                    CondemnReasons0,                        : 30
                    CondemnReasons1                         : 34
                    );
                tracepoint(
                    DotNETRuntime,
                    GCPerHeapHistory_V3_1,
                    CompactMechanisms,                      : 38
                    ExpandMechanisms,                       : 42
                    HeapIndex,                              : 46
                    (const size_t) ExtraGen0Commit,         : 50
                    Count,                                  : 54 (number of WKS::gc_generation_data's)
                    Arg15_Struct_Len_,                      : ?? not really sent
                    (const int*) Arg15_Struct_Pointer_      : [58 - 98), ...
                    );
            
            Version 3 is now setup to allow "add to the end" scenarios
            
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryTraceData.CondemnReasons0">
            <summary>
            Returns the condemned generation number
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryTraceData.CondemnReasons1">
            <summary>
            Returns the condemned condition
            </summary>
        </member>
        <member name="M:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryTraceData.GenData(Microsoft.Diagnostics.Tracing.Parsers.Clr.Gens)">
            <summary>
            genNumber is a number from 0 to maxGenData-1.  These are for generation 0, 1, 2, 3 = Large Object Heap
            genNumber = 4 is that second pass for Gen 0.  
            </summary>
        </member>
        <member name="T:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData">
            <summary>
            Version 0: Silverlight (x86), .NET 4.0
            [5] WKS::gc_generation_data
               +0x000 size_before      : Uint4B/8B
               +0x004 size_after       : Uint4B/8B
               +0x008 current_size     : Uint4B/8B
               +0x00c previous_size    : Uint4B/8B
               +0x010 fragmentation    : Uint4B/8B
               +0x014 in               : Uint4B/8B
               +0x018 out              : Uint4B/8B
               +0x01c new_allocation   : Uint4B/8B
               +0x020 surv             : Uint4B/8B
               +0x024 growth           : Uint4B/8B
               
            Version 1: ???
            
            Version 2, PreciseVersion 2.1: .NET 4.5 (x86), .NET 4.5.2 (x86)
             [5] WKS::gc_generation_data
               +0x000 size_before            : Uint4B/8B
               +0x004 free_list_space_before : Uint4B/8B
               +0x008 free_obj_space_before  : Uint4B/8B
               +0x00c size_after             : Uint4B/8B
               +0x010 free_list_space_after  : Uint4B/8B
               +0x014 free_obj_space_after   : Uint4B/8B
               +0x018 in                     : Uint4B/8B
               +0x01c out                    : Uint4B/8B
               +0x020 new_allocation         : Uint4B/8B
               +0x024 surv                   : Uint4B/8B
            
            Version 3: .NET 4.6 (x86)
            [4] WKS::gc_generation_data                                     
               +0x000 size_before            : Uint4B/8B                          
               +0x004 free_list_space_before : Uint4B/8B                    
               +0x008 free_obj_space_before  : Uint4B/8B                     
               +0x00c size_after             : Uint4B/8B                          
               +0x010 free_list_space_after  : Uint4B/8B
               +0x014 free_obj_space_after   : Uint4B/8B
               +0x018 in                     : Uint4B/8B
               +0x01c pinned_surv            : Uint4B/8B
               +0x020 npinned_surv           : Uint4B/8B
               +0x024 new_allocation         : Uint4B/8B
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.SizeBefore">
            <summary>
            Size of the generation before the GC, includes fragmentation
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.SizeAfter">
            <summary>
            Size of the generation after GC.  Includes fragmentation
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.ObjSpaceBefore">
            <summary>
            Size occupied by objects at the beginning of the GC, discounting fragmentation. 
            Only exits on 4.5 RC and beyond.
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.Fragmentation">
            <summary>
            This is the fragmenation at the end of the GC.
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.ObjSizeAfter">
            <summary>
            Size occupied by objects, discounting fragmentation.
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.FreeListSpaceBefore">
            <summary>
            This is the free list space (ie, what's threaded onto the free list) at the beginning of the GC.
            Only exits on 4.5 RC and beyond.
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.FreeObjSpaceBefore">
            <summary>
            This is the free obj space (ie, what's free but not threaded onto the free list) at the beginning of the GC.
            Only exits on 4.5 RC and beyond.
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.FreeListSpaceAfter">
            <summary>
            This is the free list space (ie, what's threaded onto the free list) at the end of the GC.
            Only exits on 4.5 Beta and beyond.
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.FreeObjSpaceAfter">
            <summary>
            This is the free obj space (ie, what's free but not threaded onto the free list) at the end of the GC.
            Only exits on 4.5 Beta and beyond.
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.In">
            <summary>
            This is the amount that came into this generation on this GC
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.Out">
            <summary>
            This is the number of bytes survived in this generation.
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.Budget">
            <summary>
            This is the new budget for the generation
            </summary>
        </member>
        <member name="P:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCPerHeapHistoryGenData.SurvRate">
            <summary>
            This is the survival rate
            </summary>
        </member>
        <member name="T:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCGlobalHeapHistoryTraceData">
            <summary>
            Version 0: ???
            
            Version 1: Silverlight (x86), .NET 4.0, .NET 4.5, .NET 4.5.2
            VM\gc.cpp
            0:041> dt -r3 WKS::gc_history_global
            coreclr!WKS::gc_history_global
               +0x000 final_youngest_desired : Uint4B/8B
               +0x004 num_heaps        : Uint4B
               +0x008 condemned_generation : Int4B
               +0x00c gen0_reduction_count : Int4B
               +0x010 reason           : 
                reason_alloc_soh = 0n0
                reason_induced = 0n1
                reason_lowmemory = 0n2
                reason_empty = 0n3
                reason_alloc_loh = 0n4
                reason_oos_soh = 0n5
                reason_oos_loh = 0n6
                reason_induced_noforce = 0n7
                reason_gcstress = 0n8
                reason_max = 0n9
               +0x014 global_mechanims_p : Uint4B
              
            FireEtwGCGlobalHeapHistory_V1(gc_data_global.final_youngest_desired, // upcast on 32bit to __int64
                                     gc_data_global.num_heaps,
                                     gc_data_global.condemned_generation,
                                     gc_data_global.gen0_reduction_count,
                                     gc_data_global.reason,
                                     gc_data_global.global_mechanims_p,
                                     GetClrInstanceId());
            Version 2: .NET 4.6
            clr!WKS::gc_history_global
               +0x000 final_youngest_desired : Uint4B/8B
               +0x004 num_heaps        : Uint4B
               +0x008 condemned_generation : Int4B
               +0x00c gen0_reduction_count : Int4B
               +0x010 reason           : 
                reason_alloc_soh = 0n0
                reason_induced = 0n1
                reason_lowmemory = 0n2
                reason_empty = 0n3
                reason_alloc_loh = 0n4
                reason_oos_soh = 0n5
                reason_oos_loh = 0n6
                reason_induced_noforce = 0n7
                reason_gcstress = 0n8
                reason_lowmemory_blocking = 0n9
                reason_induced_compacting = 0n10
                reason_lowmemory_host = 0n11
                reason_max = 0n12
               +0x014 pause_mode       : Int4B
               +0x018 mem_pressure     : Uint4B
               +0x01c global_mechanims_p : Uint4B
            
            FireEtwGCGlobalHeapHistory_V2(gc_data_global.final_youngest_desired, // upcast on 32bit to __int64
                                     gc_data_global.num_heaps,
                                     gc_data_global.condemned_generation,
                                     gc_data_global.gen0_reduction_count,
                                     gc_data_global.reason,
                                     gc_data_global.global_mechanims_p,
                                     GetClrInstanceId());
                                     gc_data_global.pause_mode, 
                                     gc_data_global.mem_pressure);
                                     
            </summary>
        </member>
        <member name="M:Microsoft.Diagnostics.Tracing.Parsers.Clr.GCBulkRootCCWTraceData.Values(System.Int32)">
            <summary>
